{
  "previous": "%Hay339T7+EL/Rb05FjdFs9ix4hIODPApTn3zZzDsCxg=.sha256",
  "sequence": 11203,
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "timestamp": 1562872474539,
  "hash": "sha256",
  "content": {
    "type": "post",
    "text": "> # [Permanent Real Estate Cooperatives](https://www.theselc.org/prec_pilot)\n>\n> ## Vision\n>\n> The Law Center is piloting a new model of cooperative real estate we’ve named the Permanent Real Estate Cooperative (“PREC”), which will permanently take land off the speculative market and into community stewardship. A PREC simultaneously decommodifies land, enables community control for structurally excluded communities, and disrupts root causes of racialized inequality. Unlike a conventional housing cooperative, which is formed to provide housing to a defined group of residents, a PREC could be described as a “movement cooperative,” because it is designed to provide housing, build a large membership base, and serve members’ collective goal to transform our neighborhoods and our systems of finance and land ownership. Our vision is for a typical PREC to have hundreds or thousands of members who look around at the land and buildings in their community and think: “We should own this!” Rather than watching the fate of their communities be determined by wealthy speculators, large companies, and absentee landlords, PREC members will build collective power, pools of capital, skills, and organized communities that can take action to shape the future of local land and buildings.\n\nThis seems *really* cool. Anyone have experience or opinions they could share?\n\nbacklink: %FHRX6fv1t1eYPO9dpSsHgbPH4A4a47wHU0kjo++ykXQ=.sha256\n\ncc: #housing + [@jordan](@6hwStvpVIQkziTyk2iK0o8lWSU1OdUXzvIl1SdXx6N4=.ed25519)",
    "mentions": [
      {
        "link": "%FHRX6fv1t1eYPO9dpSsHgbPH4A4a47wHU0kjo++ykXQ=.sha256"
      },
      {
        "link": "#housing"
      },
      {
        "link": "@6hwStvpVIQkziTyk2iK0o8lWSU1OdUXzvIl1SdXx6N4=.ed25519",
        "name": "jordan"
      }
    ]
  },
  "signature": "7SYcqXQkwVxxzTHnMIhFCnHxm+Vxpk3fxsuG4W//71Nbk5fE/kg/Y/m/vAg7UlgR49W3yAApeHIBbNVhQB13Ag==.sig.ed25519"
}