{
  "previous": "%Pnq00t47K35E1LkFeoeGdkakfuJ6EH0c29Zxxz0BYWA=.sha256",
  "sequence": 12001,
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "timestamp": 1566359538185,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%1CRsvaO8oaBQ9t0bPzbUctgSZv21p1AK7qhEF5W4mwk=.sha256",
    "fork": "%W/1/zHikfonSmyWZGEJku4ab8FhmTwKLxqlNx3bVh60=.sha256",
    "branch": "%LafWuVMRIgwsAyAcJoIi98fRkKI9fX/mWmPCZRub/MM=.sha256",
    "reply": {
      "%1CRsvaO8oaBQ9t0bPzbUctgSZv21p1AK7qhEF5W4mwk=.sha256": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
      "%LafWuVMRIgwsAyAcJoIi98fRkKI9fX/mWmPCZRub/MM=.sha256": "@TXKFQehlyoSn8UJAIVP/k2BjFINC591MlBC2e2d24mA=.ed25519"
    },
    "channel": null,
    "recps": null,
    "text": "[@dangerousbeans](@TXKFQehlyoSn8UJAIVP/k2BjFINC591MlBC2e2d24mA=.ed25519)\n\n> You yourself are suggesting a lot in the above post that I am against *anti discrimination* laws which I’m now having to defend.\n\nMaybe you could take some time and write down a concrete explanation of the point you’re trying to make? It feels like you’re expecting people to read between the lines and it’s hard to come up with a charitable interpretation to what you’re implying.\n\n> Not suggesting net neutrality was a bad thing. It is of course an essential thing that the internet is neutral, similar to how language should be neutral.\n\nYes, just like both housing and employment should be neutral. Net neutrality laws restrict ISPs from practicing discrimination the same way that anti-discrimination laws restrict landlords and bosses from practicing discrimination. Neutrality is not zero-sum, you can't have it without restricting people from discrimination.\n\n> However bringing this up as a point against what I’m saying in such a hostile ways is telling that you’re just fed up and want this to go away - you’re not actually trying to find any meaning in what I’m saying. “Over half the people feel like they can’t speak freely” would be a statement with similar impact to the one you’re calling out\n\nI don't mean to be hostile, but I don't think it's cool that your original post talks about \"analysis of scientific literature\" when you're operating on catchy infographics from right-wing thinktanks. I don't want this to go away, I want you to come out with the ideas you're trying to push rather than dance around them. \n\nI don't want to live in a world where people can't talk about their ideas, but maybe it's not terrible that half of the US population is second-guessing their opinions before announcing them to the world? If this study is the crux of your argument then I'm happy to spend more time and research it more thoroughly, but I'd like for you to commit to a falsifiable idea rather than throw random facts at the wall, ask people to read between the lines, and then get upset when people misunderstand your point. ",
    "mentions": [
      {
        "link": "@TXKFQehlyoSn8UJAIVP/k2BjFINC591MlBC2e2d24mA=.ed25519",
        "name": "dangerousbeans"
      }
    ]
  },
  "signature": "2zytjfQr2gKKudY3LaSryM4Rn8Lv2GmMcRLnH7OEb6Mg67uIXYxax72JmGawl+88vXgGQ6fCNDxGVHMjXwrYBg==.sig.ed25519"
}