{
  "previous": "%Xal9S/sfTiUHAzKvOA9WgWwcJ9nQddUmQV3QUWdAduQ=.sha256",
  "sequence": 12182,
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "timestamp": 1567439508702,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%bEMma2mM93ipV0qx/nEP2zqogyskno+M6F2CDKH+08E=.sha256",
    "branch": "%qquUah1I26j+0PNabCk1vpUHOLs0fVvkdPGmiI16mbI=.sha256",
    "reply": {
      "%bEMma2mM93ipV0qx/nEP2zqogyskno+M6F2CDKH+08E=.sha256": "@xr/Q/zqaEwmmd4wg8xRU1TrMLQhc9qBqNCioCqmv1vQ=.ed25519",
      "%qquUah1I26j+0PNabCk1vpUHOLs0fVvkdPGmiI16mbI=.sha256": "@tUMwMvb+roaOJAyohpGUxgqYo4E7HfBlY0NkUzALqjY=.ed25519"
    },
    "channel": null,
    "recps": null,
    "text": "[@romuloalves](@xr/Q/zqaEwmmd4wg8xRU1TrMLQhc9qBqNCioCqmv1vQ=.ed25519) \n\n🙌 \n\n> This things touches me and I want to try to become vegan but it’s really difficult to transform the things we eat daily. \n\nIf you can, start with the easier stuff. If you want to reduce your participation in animal agriculture then reducing meat from your diet is likely the largest change you can make, and I'd make sure you're comfortable (and healthy!) eating a vegetarian diet before throwing energy at reducing other animal products. I'd argue that if it's something you care about then it's something you should do slowly enough to ensure that it's sustainable and healthy for you -- you *can* go vegan with an all-Oreo diet, but it's not a long-term solution. \n\n> Moreover, it’s a things that depends not just on you but your family and friends.\n\nIt's true! And again, I don't think there's a ton of utility in immediately insisting \"I won't eat animal products\", but I *do* think that eating different food around your family and friends is useful in showing them options that don't suck. Most people will continue eating their current diet for the rest of their lives, and that's not something you can probably change, but worst-case scenario you're normalizing your ethics and reducing your participation in systems you don't like.\n\nI also want to add a 👍 on everything [@daan](@MRiJ+CvDnD9ZjqunY1oy6tsk0IdbMDC4Q3tTC8riS3s=.ed25519) said -- Cowspiracy was solid and I liked that they share their [citations](https://www.cowspiracy.com/facts/), but some of their statistics have been [criticized](https://en.m.wikipedia.org/wiki/Cowspiracy#Reception). The production team then created a documentary called [What The Health](https://en.m.wikipedia.org/wiki/What_the_Health), which was just plain pseudoscience in support of veganism. 😕 \n\nI *did* like [Earthlings](https://en.m.wikipedia.org/wiki/Earthlings_(film)), [The Ghosts in Our Machine](https://en.wikipedia.org/wiki/The_Ghosts_in_Our_Machine), and even [Okja](https://en.m.wikipedia.org/wiki/Okja) (not a documentary but really good), but they're all more focused on the ethics rather than the ecological and health benefits.\n\n🌱 ",
    "mentions": [
      {
        "link": "@xr/Q/zqaEwmmd4wg8xRU1TrMLQhc9qBqNCioCqmv1vQ=.ed25519",
        "name": "romuloalves"
      },
      {
        "link": "@MRiJ+CvDnD9ZjqunY1oy6tsk0IdbMDC4Q3tTC8riS3s=.ed25519",
        "name": "daan"
      }
    ]
  },
  "signature": "nGlC4Mh0eP4rrpBik9lawKj3HLs8H4t82nZNcxsz20LK1sZi5EVirUlvQ33/sJ3RfgFowKrS3pliEctdF/+7AQ==.sig.ed25519"
}