{
  "previous": "%Wfzq4cyfmsP/QPJwkMZvD/lJbLTj2nG0Bi6hmjRNQb4=.sha256",
  "sequence": 12205,
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "timestamp": 1567614105601,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%GxqWv6YYATE1Xa7W+kYs51uiEfU7qFjawuDkSts3m+w=.sha256",
    "fork": "%Sm7waKYWGBliqritDaXktMFlryzX1uymdtkh4XgP2o0=.sha256",
    "branch": "%GxqWv6YYATE1Xa7W+kYs51uiEfU7qFjawuDkSts3m+w=.sha256",
    "reply": {
      "%GxqWv6YYATE1Xa7W+kYs51uiEfU7qFjawuDkSts3m+w=.sha256": "@Gs0Rz7yEabDd1GyrnjZ1acPrcHL+rx8irnLl4ys/sU4=.ed25519"
    },
    "channel": null,
    "recps": null,
    "text": "[@trav](@Gs0Rz7yEabDd1GyrnjZ1acPrcHL+rx8irnLl4ys/sU4=.ed25519) \n\nThanks! I actually *just* saw some of your Sim City 2000 videos on Vimeo after watching your dweb camp video. I never played it but I like base building games so I'd imagine it might be cool? I'm super inspired by [mapgen4](https://www.redblobgames.com/maps/mapgen4/) too, all the good map generators are use fancy gradient noise for elevation but mine just goes to each tile and does a sequence of steps:\n\n- flip a weighted coin to determine whether it should be land -- the coin *heavily* favors water, so there are only a few random islands around the map\n- if the tile is water near land, flip a weighted coin to determine whether it should become land as well -- this lets islands expand and sprawl and connect to each other\n- if the tile is a land tile with 3 water neighbors, delete it -- this minimizes thin sprawling peninsulas\n- if the tile is a water tile and land is > 2 tiles away, mark it as ocean\n- if the tile is land and surrounded by land, flip a coin to determine whether it should become a mountain -- this coin is weighted toward *not* becoming a mountain unless there are other mountains nearby, which is how it makes small mountain ranges\n- if the tile is a mountain tile with too few mountain neighbors or too many mountain neighbors, delete it (similar to the peninsula deletion)\n- if the tile is a land tile with no other settlements nearby, flip a weighted coin to determine if it becomes a settlement\n- if the tile is a land tile surrounded by land tiles, flip a weighted coin to determine if it becomes a forest -- forests are more likely to spawn near other forests *and* near mountains\n\nThe probabilities were a pain in the ass to tune because I tried to get them to work regardless of the board size, so most of them are like `1 / squareRoot(boardWidth)` or something silly.",
    "mentions": [
      {
        "link": "@Gs0Rz7yEabDd1GyrnjZ1acPrcHL+rx8irnLl4ys/sU4=.ed25519",
        "name": "trav"
      }
    ]
  },
  "signature": "w9BzFuts8/uEswOq2Ehf81H6nmVRjFN4Bb4lK+A8NexC3I/+ImKU9PzX/poKkG69tGsd6PBkr5otC0xqdUWBAw==.sig.ed25519"
}