{
  "previous": "%kB34D4IDTDBGLZh96LiELEhSOwght0Y4uua4LiVvask=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 3071,
  "timestamp": 1535734856149,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%TzIObwqH6H+FLYpIQ/Mq9TSYwypQRaqaAV+HB05xCwc=.sha256",
    "branch": "%6U6/qC5MVJnyYEE9bzkbo5XkPb6fKnK+Uou/xGaaHZw=.sha256",
    "text": "[@Alberto](@+ISTRPn8o7Sx667rj1EPtQ9ZPiGLLZMGI7qcJjBoA+8=.ed25519) \n\nHi! I started out on Mastodon (specifically https://social.coop) but found that it was much of the same Twitter-style discourse that I didn't get a lot of value from. I got much more interested in cooperatives, but unfortunately I didn't find it exciting enough to stay.\n\nOn a technical note, I'm much happier with a p2p system where each of us can run our own client. While I appreciate democracy, I was constantly getting notifications about new instances to block and a lot of administrative overhead I wasn't interested in contributing to. I *personally* get a lot more value out of making these decisions myself, but that may be a personal preference or just a growing pain that the fediverse was going through.\n\nI've also found that the communities had pretty stark differences. There's plenty of small beef on SSB, but we can mostly agree that consensus isn't always necessary and that having lots of different clients is a good thing. In the fediverse someone from my instance criticized Pleroma (another fediverse alternative to Mastodon) and the lead developer of Pleroma contacted our hosting company to get our instance banned for libel.\n\nI'd recommend https://social.coop over all of the other instances I've seen, although admittedly I haven't been super active there lately. I'd be interested in hearing [@Mayel](@aTQuVwkglxM9TABZlDBk1NF4rqfe1v6yjyH+KFb3mPI=.ed25519)'s opinions here as well.\n\nCheers!",
    "mentions": [
      {
        "link": "@+ISTRPn8o7Sx667rj1EPtQ9ZPiGLLZMGI7qcJjBoA+8=.ed25519",
        "name": "Alberto"
      },
      {
        "link": "@aTQuVwkglxM9TABZlDBk1NF4rqfe1v6yjyH+KFb3mPI=.ed25519",
        "name": "Mayel"
      }
    ]
  },
  "signature": "fb7kFo2IxIMpc6fMqmUFaBBHyVd+4Xmnn8jW/+xM6qJet+vM8iXXim4IlDcgPB4p1Az+A8JmnoOTUCbDTV8ADQ==.sig.ed25519"
}