{
  "previous": "%T3A8p0FwsC5gWxdTMeEHuUpXmKFz81eM6qv7shzsS/M=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 7100,
  "timestamp": 1541608556658,
  "hash": "sha256",
  "content": {
    "type": "post",
    "text": "# Election Results\n\nI'm not really into electoral politics. Honestly, I'm deeply skeptical of them, and hesitant to lend any credibility by participating, but since *not participating* seems to give free reign to folks like Donald Trump I decided to give it a shot. Here's a summary of what went down last night.\n\n## United States\n\nOur legislature is broken into two because of a thing called the [Connecticut Compromise](https://en.wikipedia.org/wiki/Connecticut_Compromise). Each state sends representatives to both houses: always two senators to the Senate, and a variable number of representatives to the House of Representatives, depending on population. In turn, this means that the House of Representatives often maps better to *what the people want* and the Senate maps better to *what states want*, which is often a proxy for *what people in low-population states want*. For example, the House originally proposed to [ban slavery](https://en.wikipedia.org/wiki/Wilmot_Proviso) and the Senate shot it down.\n\n- **Senate:** Republicans maintained their majority in the Senate. Meh.\n- **House:** Democrats won back the majority of the House, which means Republicans can't rubber-stamp their own bills anymore. Nice.\n\n## Oregon\n\nMy state! I'm over on the West coast, just above California, and while the heavily populated areas lean toward Democrat/Progressive/Green, the rural  areas are still pretty right-wing and often vote for Republican candidates. For example, here are the results of the governor race:\n\n![oregon governor race kate brown knute buehler](&IWvMjK6YmkO00Z3oqXRvPbjWoUAcOPpiqku5P6Ukg+4=.sha256)\n\n- **Governor:** Incumbent Democrat Kate Brown maintains her governorship against a Republican challenger. Nice.\n- **Measure 102:** A constitutional amendment to allow local governments to issue bonds for housing projects passed. Nice.\n- **Measure 103:** An lobbying group attempt to remove taxes from grocery stores has failed. Nice.\n- **Measure 104:** A proposal to make it difficult to raise taxes has failed. Nice.\n- **Measure 105:** An attempt to get Oregon police to collaborate with federal immigration has failed. Nice.\n- **Measure 106:** An attempt to ban abortion funding with taxpayer dollars has failed. Nice.\n\n## Local\n\n- **State House District 42**: Incumbent Democrat Rob Nosse maintains his seat with 94% of the vote. Nice.\n- **Metro Councilor, District 2:** Too close to call.\n- **Measure 26-199, Metro Affordable Housing Bonds :** A bond proposal for $632 million aimed at affordable housing passed. Nice.",
    "mentions": [
      {
        "link": "&IWvMjK6YmkO00Z3oqXRvPbjWoUAcOPpiqku5P6Ukg+4=.sha256",
        "name": "oregon governor race kate brown knute buehler",
        "type": "image/png",
        "size": 23231
      }
    ]
  },
  "signature": "NLbqMh8NQMMMqCL+c5602vr8ITvENlv2yFqFMEp7bEDA4Ro4JaR7D4OvxI6TJ5oStctAwBZb8iwyaOMid0wVDg==.sig.ed25519"
}