{
  "previous": "%dKG3BI6F1JaiUyCgKhWOvK6bjrYVtUwlT/IuKHXM9t0=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 750,
  "timestamp": 1531945355866,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%4pYkhlKCmfLJYbR9LBcvsYwRXvw50hwcLgCmiZ0z9yM=.sha256",
    "branch": "%3BBrgvgr0P29zw0ujtilhkw9sQBN70RfnPbef7tmnxQ=.sha256",
    "text": "[@nanomonkey](@+D0ku/LReK6kqd3PSrcVCfbLYbDtTmS4Bd21rqhpYNA=.ed25519) \n\n> On the topic of making your own medication...I have a hard time not seeing food as medicine.\n\nTrue, I could probably stand to be a bit more intentional about what I eat and paying attention to how it affects how I feel. I'm *generally* pretty good about not eating complete junk food, but balancing macronutrients is only sometimes a priority and I rarely wonder how micronutrients are going to influence my mood. Don't even get me started on phytonutrients.\n\n> Not suggesting you make your own methyl salts for ADHD...but often times the right foods or tea will do wonders for discomfort, mental fatigue or pain. The opposite, eating shit foods, can really ruin your life.\n\nSomeday I'll graduate from coffee to tea. Someday. Until then, I've found taking a bit of theanine with my morning coffee really rounds out my buzz.\n\n[@Tim Schumacher](@o3eDT3n9urv1cyIWDuF+wQHBFj3I8OcE3L4Tla9RR8A=.ed25519) \n\nI used to treat my morning showers as essential parts of my day, but since I started trimming my hair with clippers I realize I only really feel like a morning shower when my hair is messed up. Otherwise, when I'm *actually* dirty, I'll usually shower before bed.\n\nWe always have a few Lush products in the house, but part of me wonders whether we could DIY similar products with minimal hassle. I suppose most things can be done yourself, so I'm sure moderation is key.\n\n[@kas](@dBQlwh9Gtr3i5YMOGtIOKtGNVepeu+nyb6KGl1vtOcM=.ed25519) \n\nThat sounds like a really refreshing routine. I used to use the scented liquid castile soap in little gooTube (goTube? I don't remember) containers, but I had a friend who told me that the essential oils were harsh on silicone and that unscented soap increased the longetivity of the containers. I haven't seen any actual research on it--and I'm offline now--but at least from a utilitarian perspective I understand why adding fragrances might affect longetivity.\n\nIf you end up making any rosemary-scented soaps I'd love to see photos and text of your process!",
    "mentions": [
      {
        "link": "@+D0ku/LReK6kqd3PSrcVCfbLYbDtTmS4Bd21rqhpYNA=.ed25519",
        "name": "nanomonkey"
      },
      {
        "link": "@o3eDT3n9urv1cyIWDuF+wQHBFj3I8OcE3L4Tla9RR8A=.ed25519",
        "name": "Tim Schumacher"
      },
      {
        "link": "@dBQlwh9Gtr3i5YMOGtIOKtGNVepeu+nyb6KGl1vtOcM=.ed25519",
        "name": "kas"
      }
    ]
  },
  "signature": "GU99MfnTZCFyzjrnQxirc5OHIqijMjOJpyG/ESs6JQGImxuPrfe4mVOm/feMWlGlSNJ1MT7TFEZfEpyXumUGBw==.sig.ed25519"
}