{
  "previous": "%yvsP8Wce7gVXyZPKIo21IMelawaH08/eFqwVR5Iyq5Q=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 7948,
  "timestamp": 1544402430592,
  "hash": "sha256",
  "content": {
    "type": "post",
    "text": "# Scuttlebutt and less-statey spaces\n\n> the land fights back\n\nLast night [@kathleen](@GSuGLzJa8t3aJCLvs66Ekn7MXdr3yqCSzsd6z2iUEBY=.ed25519) and I watched [this video](https://www.youtube.com/watch?v=ECch2g1_6PQ) which introduced me to the concept of non-state spaces. I'm under the impression that the concept came from a book called *The Art of Not Being Governed: An Anarchist History of Upland Southeast Asia*, and after watching the short video I'm really interested in exploring the idea. **Is anyone else familiar with this book or have input on the ideas it presents?**\n\nMy shallow understanding is that when the terrain is rough and communities are robust, that governments will often give up on trying to exert dominance on the region and appropriate its labor. I'm sure there are all sorts of examples of this, but this reminded me of a movie I watched about the [Free State of Jones](https://en.wikipedia.org/wiki/Jones_County,_Mississippi#Free_State_of_Jones), which fought the Confederates by defending swamps and pine forests that were inhospitable to both governments and cotton farms.\n\nThe next thing I thought of, as you can probably assume, is Scuttlebutt. Like the mountains of southeast Asia and the swamps of Mississippi, I can see a strong parallel in our **rugged topology**. It doesn't matter whether we're talking about geography or social structures, when it's difficult to push objects/influence/data through some topology it's difficult to exert control. Scuttlebutt-adjacent spaces like Reddit/Twitter/Facebook act as instruments for powerful people to push whatever they'd like, but Scuttlebutt doesn't work that way.\n\nI don't think that we're anywhere near being a \"non-state space\", since we mostly use the global internet backbone and often depend on a global supply chain for sustenance, but I'm enjoying our *less-statey* space and I think we're on the right track for that to continue.\n\ncc: [@mix](@ye+QM09iPcDJD6YvQYjoQc7sLF/IFhmNbEqgdzQo3lQ=.ed25519) this started out as a Signal message and turned into a full-blown post",
    "mentions": [
      {
        "link": "@GSuGLzJa8t3aJCLvs66Ekn7MXdr3yqCSzsd6z2iUEBY=.ed25519",
        "name": "kathleen"
      },
      {
        "link": "@ye+QM09iPcDJD6YvQYjoQc7sLF/IFhmNbEqgdzQo3lQ=.ed25519",
        "name": "mix"
      }
    ]
  },
  "signature": "bLxThWXgM5NHLmfskqpOSmNFXxfrrijCU+iQaT6GI22nIA6oyUu1EdtjX9YxgRe2QBhofs0N/pg7KSvLDjFIDg==.sig.ed25519"
}