{
  "previous": "%tPIeAEnD90TKjVXcX1+XSk/7pYtdcPnCEaExZDvP2bw=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 7975,
  "timestamp": 1544478303240,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%r/xWh3ZcPv/QNZ01AjGPqosiL1OGKgnNmpcXOwFNWWg=.sha256",
    "branch": "%FZZOnzGsjoqLxFZy/3vH0alOcj1EHRUwzPVG7UPYM3Q=.sha256",
    "text": "[@dominic](@EMovhfIrFk4NihAKnRNhrfRaqIhBv1Wj8pTxJNgvCCY=.ed25519)\n\nYour example reminded me of a quote from a Chomsky interview (emphasis mine, of course):\n\n>  I was attracted to anarchism as a young teenager, as soon as I began to think about the world beyond a pretty narrow range, and haven't seen much reason to revise those early attitudes since. I think it only makes sense to seek out and identify structures of authority, hierarchy, and domination in every aspect of life, and to challenge them; unless a justification for them can be given, they are illegitimate, and should be dismantled, to increase the scope of human freedom. That includes political power, ownership and management, relations among men and women, parents and children, our control over the fate of future generations (the basic moral imperative behind the environmental movement, in my view), and much else. Naturally this means a challenge to the huge institutions of coercion and control: the state, the unaccountable private tyrannies that control most of the domestic and international economy, and so on. But not only these. **That is what I have always understood to be the essence of anarchism: the conviction that the burden of proof has to be placed on authority, and that it should be dismantled if that burden cannot be met. Sometimes the burden can be met. If I'm taking a walk with my grandchildren and they dart out into a busy street, I will use not only authority but also physical coercion to stop them.The act should be challenged, but I think it can readily meet the challenge.** And there are other cases; life is a complex affair, we understand very little about humans and society, and grand pronouncements are generally more a source of harm than of benefit. But the perspective is a valid one, I think, and can lead us quite along way.\n\nHe uses the word \"authority\" rather than \"violence\", but I think we may be talking about similar things.",
    "mentions": [
      {
        "link": "@EMovhfIrFk4NihAKnRNhrfRaqIhBv1Wj8pTxJNgvCCY=.ed25519",
        "name": "dominic"
      }
    ]
  },
  "signature": "CfkW1vIv+KJf33av+uI0O5DrnpONIgwh8xkWdWwpmxl7Ki0ivfCmjfkllvirwcaLdadMELV2gavOxV8FWyezBQ==.sig.ed25519"
}