{
  "previous": "%Oe0SgrjUV16jKcqUrwOoFOR1kc/zn7OqDBNw/RBHDOg=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 8006,
  "timestamp": 1544635074526,
  "hash": "sha256",
  "content": {
    "type": "post",
    "text": "> # An open letter to @Facebook, @Twitter, @Instagram and @Experian regarding algorithms and my son's birth:\n\nI found this [on Twitter](https://twitter.com/gbrockell/status/1072589687489998848) and wanted to share here. This content deals with death, so please feel free to skip this post if you aren't in a good headspace for that.\n\n> Dear Tech Companies:\n>\n> I know you knew I was pregnant. I's my fault, I just couldn't resist those Instagram hashtags - #30weekspregnant, #babybump. And, stupid me!, I even clicked once or twice on the maternity-wear ads Facebook served up.\n>\n> You surely saw my heartfelt thank-you post to all the girl friends who came to my baby shower, and the sister-in-law who flew in from Arizona for said shower tagging me in her photos. You probably saw me googling “holiday dress maternity plaid” and \"babysafe crib paint.” And I bet Amazon even told you my due date, January 24th, when I created an Amazon registry.\n>\n> But didn't you also see me googling “is this braxton hicks?\" and “baby not moving\"? Did you not see the three days of silence, uncommon for a high-frequency user like me? And then the announcement with keywords like “heartbroken” and “problem” and “stillborn” and the two-hundred teardrop emoticons from my friends? Is that not something you could track?\n>\n> You see, there are 26,000 stillbirths in the US every year, and millions more among your worldwide users; and let me tell you what social media is like when you finally come home from the hospital with the emptiest arms in the world, after you've spent days sobbing in bed, and. pick up your phone for a couple minutes of distraction before the next wail. I's exactly, crushingly, the same as it was when your baby was stil alive. Pea in the Pod. Motherhood Maternity. Latched Mama. Every goddam Etsy tchotchke I was planning for the nursery.\n>\n> And when we millions of brokenhearted people helpfully click “I don’t want to see this ad,” and. even answer your “why?” with the cruel-but-true “It's not relevant to me,” do you know what your algorithm decides, Tech Companies? It decides you've given birth, assumes a happy result, and deluges you with ads for the best nursing bras {I have cabbage leaves on my breasts because that is the best medical science has to offer to turn your milk off, tricks to get the baby to sleep through the night I would give anything to hear him cry at all, and the best strollers to grow with your baby [mine will forever be 4 pounds, 1 ounce].\n>\n> And then, after all that, Experian swoops in with the lowest tracking blow of them all: a spam email encouraging me to “finish registering your baby” (I never “started” but sure) to track his credit throughout the life he will never lead.\n>\n> Please, Tech Companies, I implore you: If you're smart enough to realize that I'm pregnant, that, I've given birth, then surely you're smart enough to realize that my baby died, and can advertise to me accordingly, or maybe just maybe, not at all\n>\n> Regards,  \n> Gillian\n",
    "mentions": [
      {
        "link": "#babybump"
      }
    ]
  },
  "signature": "WnMm8fy0Oo9w1EXp4M3nb1jyGPYXgVSWXQ5dU+wVU/GXIVjrdNFAvfb5wkJOYM6FwHdvo8oCnA85SASC7nYyDg==.sig.ed25519"
}