{
  "previous": "%p+wwT+U2+4xfzGag76ZpW7BlMxowOAZXBdc2RvOdLc8=.sha256",
  "author": "@+oaWWDs8g73EZFUMfW37R/ULtFEjwKN/DczvdYihjbU=.ed25519",
  "sequence": 9015,
  "timestamp": 1550820337668,
  "hash": "sha256",
  "content": {
    "type": "post",
    "root": "%f4ImE5lNMmKkRHu93lqXGeKy52REF0pV7EyfvSou+U0=.sha256",
    "branch": "%bmoNmT0PuSL2dt4jVJ5vAhQrw+u+RLXrdubhxkgQN8k=.sha256",
    "text": "I love seeing everyone's packing list! This is such a great thread to be able to read though.\n\n[@dan](@NeB4q4Hy9IiMxs5L08oevEhivxW+/aDu/s/0SkNayi0=.ed25519) \n\n> now that you have been in nz a couple of days is there anything you wish you had brought, or something you realise you won't need?\n\nPower adapters! We only brought one to share between the two of us, which is *mostly fine* because we can power a laptop and then charge our phones at the same time via the laptop's USB ports, but it would be really nice to have more. Also, [@cryptix](@p13zSAiOpguI9nsawkGijsnMfWmFd5rlUNpzekEE+vI=.ed25519) noticed that some of the \"universal\" adapters didn't actually work with his electronics. I have [these](https://smile.amazon.com/dp/B00E7P7UHK) and they're fine.\n\nOur laptop and phone chargers convert the voltage, but I have beard trimmer that I can't charge because I don't have a voltage adapter. It has a battery that's still running fine, but it'd be nice to have a voltage converter as well. I thought I'd find one at an international airport terminal but didn't find any. Admittedly I didn't look very hard.\n\nI ended up *not* bringing the book, which I think was a good call, and in the future I'm not sure I'll bring the inflatable pillow. I'm sure I could DIY a pillow out of the rest of my bag if I really needed one, and on our 13-hour flight we got little pillows anyway.",
    "mentions": [
      {
        "link": "@NeB4q4Hy9IiMxs5L08oevEhivxW+/aDu/s/0SkNayi0=.ed25519",
        "name": "dan"
      },
      {
        "link": "@p13zSAiOpguI9nsawkGijsnMfWmFd5rlUNpzekEE+vI=.ed25519",
        "name": "cryptix"
      }
    ]
  },
  "signature": "2FzUI6uLolxmUreulMEYbvhXxYYOxUCgBZ3RAMGPShCjz+tEVAtTyx25iSV9BrSaYh+PoTPD5I88J4EkTuqWAQ==.sig.ed25519"
}